# Python Fundamentals 2025: Домашнее задание 17
# 1. Проверка на подмножество
# Напишите программу, которая проверяет, содержит ли первое множество
# все элементы второго множества.
# Реализуйте решение несколькими способами.
# Решите одним из способов не используя возможности множеств.
#
# Данные:
# set1 = {1, 2, 3, 4}
# set2 = {2, 3}
# Пример вывода: True

# Var  c возможностями множеств
# set1 = {1, 2, 3, 4}
# set2 = {2, 3}
#
# print(set1.issuperset(set2))
# print(False if set2.difference(set1) else True)
# print(set1 >= set2)
# print(set(set1) >= set(set2))
#________________
# VAR 2, цикл for
# set1 = {1, 2, 3, 4}
# set2 = {2, 3}
# result = True

# for s2 in set2:
#     if s2 not in set1:
#         result = False
#         break
# print(result)

#___________________________
# 2. Зеркальное подмножество
# Напишите программу, которая проверяет,
# являются ли элементы одного
# из множеств подмножеством другого.
# В случае положительного ответа
# возвращает разницу между двумя множествами.
# Проверить необходимо в обе стороны.

# Данные:
# set1 = {2, 3, 4, 5, 6}
# set2 = {4, 5}

# Пример вывода:
# Подмножество: True
# Разница: {2, 3, 6}

# # VAR 1
# set1 = {2, 3, 4, 5, 6}
# set2 = {8, 7}
# check = True if set2.issubset(set1) or set1.issuperset(set2) else False
# diff = {}
# if set2.issubset(set1):
#     diff = set1 - set2
# elif set1.issubset(set2):
#     diff = set2 - set1
# elif set1 not in set2:
#     diff = set1 ^ set2
# print(f'Подмножество: {check}\nРазница:{diff}')

# тесты:
# set1 = {2, 3, 4, 5, 6}
# set2 = {4, 5}

# set1 = {2, 3, 4, 5, 6}
# set2 = {8, 7}

# set1 = {2, 3, 4, 5, 6}
# set2 = {8, 2, 3, 4, 5, 6}

# set1 = {2, 3}
# set2 = {8, 2, 3, 4, 5, 6}

# set1 = {1, }
# set2 = {8, 2, 3, 4, 5, 6}

# set1 = {-1, }
# set2 = {8, 2, 3, 4, 5, 6}

# set1 = {-1, 0.5}
# set2 = {8, 2, 3, 4, 5, 6}

# set1 = {-1,"jhh"}
# set2 = {8, 2, 3, 4, 5, 6}

