# Python Fundamentals 2025: Домашнее задание 32

# 1.Фабрика функций округления
# Создайте функцию make_rounder(),
# которая принимает количество знаков для округления
# и возвращает другую функцию.
# Полученная функция должна принимать число и возвращать его,
# округлённое до указанного ранее количества знаков после запятой.
# Пример вызова:
# print(round2(3.14159))
# print(round2(2.71828))
# print(round0(9.999))
# Пример вывода:
# 3.14
# 2.72
# 10.0

# def make_rounder(data):
#     def rounder(number):
#         return round(number, data)
#     return rounder
#
# round_0 = make_rounder(0)
# round_2 = make_rounder(2)
# print(round_2(3.14159))
# print(round_2(2.71828))
# print(round_0(9.999))

#_____________________________
# 2.Расширяемый логгер событий
# Создайте функцию, которая возвращает вложенный логгер событий.
# Каждый вызов логгера должен сохранять событие с
# текущим временем (если оно передано)
# и возвращать весь список событий.
# Пример вызова:
# log("Загрузка данных")
# log("Обработка завершена")
# log("Сохранение файла")
# for event in log():
#     print(event)
#
# Пример вывода:
# Загрузка данных: 2025-03-24 14:06:29
# Обработка завершена: 2025-03-24 14:06:29
# Сохранение файла: 2025-03-24 14:06:29

# import datetime
# def create_logger():
#     events = []
#     def logger(massage=None):
#         if massage:
#             current_time = datetime.datetime.now().strftime("%Y-%m-%d %H:%M:%S")
#             events.append(f"{massage}:{current_time}")
#         return events
#     return logger
# log = create_logger()
# log("Загрузка данных")
# log("Обработка завершена")
# log("Сохранение файла")
# for event in log():
#     print(event)

#_____________________
# 3.Рамка вокруг вывода
# Создайте декоратор frame, который оборачивает
# результат функции рамкой из 50 символов -,
# выводя по строке до и после вызова функции.
# Пример декорируемой функции:
# def say_hello():
#     print("Привет, игрок!")
#
# Пример вывода:
#
# --------------------------------------------------
#
# Привет, игрок!
#
# --------------------------------------------------
# def dec_frame(func):
#     def wrapper():
#         print("-" * 50)
#         func()
#         print("-" * 50)
#     return wrapper
#
# @dec_frame
# def say_hello():
#     print("Привет, игрок!")
#
# say_hello()